Oryx-Embedded/CycloneCRYPTO/hardware/f2838x/f2838x_crypto_cipher.c
/**
 * @file f2838x_crypto_cipher.c
 * @brief TMS320F2838xD cipher hardware accelerator
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneCRYPTO Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.4
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL CRYPTO_TRACE_LEVEL

//Dependencies
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_types.h"
#include "inc/hw_memmap.h"
#include "inc/hw_aes.h"
#include "driverlib_cm/aes.h"
#include "core/crypto.h"
#include "hardware/f2838x/f2838x_crypto.h"
#include "hardware/f2838x/f2838x_crypto_cipher.h"
#include "cipher/cipher_algorithms.h"
#include "cipher_modes/cipher_modes.h"
#include "aead/aead_algorithms.h"
#include "debug.h"

//Check crypto library configuration
#if (F2838X_CRYPTO_CIPHER_SUPPORT == ENABLED && AES_SUPPORT == ENABLED)


/**
 * @brief Set AES operation mode
 * @param[in] mode Mode of operation
 **/

void aesSetMode(uint32_t mode)
{
   //Perform a software reset
   AES_SYSCONFIG_R |= AES_SYSCONFIG_SOFTRESET;

   //Wait for the reset to complete
   while((AES_SYSSTATUS_R & AES_SYSSTATUS_RESETDONE) == 0)
   {
   }

   //Backup the save context field before updating the register
   if((AES_CTRL_R & AES_CTRL_SAVE_CONTEXT) != 0)
   {
      mode |= AES_CTRL_SAVE_CONTEXT;
   }

   //Write control register
   AES_CTRL_R = mode;
}


/**
 * @brief Load AES key
 * @param[in] context AES algorithm context
 **/

void aesLoadKey(AesContext *context)
{
   uint32_t temp;

   //Read control register
   temp = AES_CTRL_R & ~AES_CTRL_KEY_SIZE_M;

   //Check the length of the key
   if(context->nr == 10)
   {
      //10 rounds are required for 128-bit key
      AES_CTRL_R = temp | AES_KEY_SIZE_128BIT;

      //Set the 128-bit encryption key
      AES_KEY1_0_R = context->ek[0];
      AES_KEY1_1_R = context->ek[1];
      AES_KEY1_2_R = context->ek[2];
      AES_KEY1_3_R = context->ek[3];
   }
   else if(context->nr == 12)
   {
      //12 rounds are required for 192-bit key
      AES_CTRL_R = temp | AES_KEY_SIZE_192BIT;

      //Set the 192-bit encryption key
      AES_KEY1_0_R = context->ek[0];
      AES_KEY1_1_R = context->ek[1];
      AES_KEY1_2_R = context->ek[2];
      AES_KEY1_3_R = context->ek[3];
      AES_KEY1_4_R = context->ek[4];
      AES_KEY1_5_R = context->ek[5];
   }
   else
   {
      //14 rounds are required for 256-bit key
      AES_CTRL_R = temp | AES_KEY_SIZE_256BIT;

      //Set the 256-bit encryption key
      AES_KEY1_0_R = context->ek[0];
      AES_KEY1_1_R = context->ek[1];
      AES_KEY1_2_R = context->ek[2];
      AES_KEY1_3_R = context->ek[3];
      AES_KEY1_4_R = context->ek[4];
      AES_KEY1_5_R = context->ek[5];
      AES_KEY1_6_R = context->ek[6];
      AES_KEY1_7_R = context->ek[7];
   }
}


/**
 * @brief Perform AES encryption or decryption
 * @param[in] context AES algorithm context
 * @param[in,out] iv Initialization vector
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[in] mode Operation mode
 **/

void aesProcessData(AesContext *context, uint8_t *iv, const uint8_t *input,
   uint8_t *output, size_t length, uint32_t mode)
{
   uint32_t temp;

   //Acquire exclusive access to the AES module
   osAcquireMutex(&f2838xCryptoMutex);

   //Set operation mode
   aesSetMode(mode);
   //Set encryption key
   aesLoadKey(context);

   //Valid initialization vector?
   if(iv != NULL)
   {
      //Set initialization vector
      AES_IV_IN_OUT_0_R = LOAD32LE(iv);
      AES_IV_IN_OUT_1_R = LOAD32LE(iv + 4);
      AES_IV_IN_OUT_2_R = LOAD32LE(iv + 8);
      AES_IV_IN_OUT_3_R = LOAD32LE(iv + 12);
   }

   //Process data
   while(length >= AES_BLOCK_SIZE)
   {
      //Wait for the AES engine to be ready to accept data
      while((AES_CTRL_R & AES_CTRL_INPUT_READY) == 0)
      {
      }

      //Write input block
      AES_DATA_IN_OUT_3_R = LOAD32LE(input);
      AES_DATA_IN_OUT_2_R = LOAD32LE(input + 4);
      AES_DATA_IN_OUT_1_R = LOAD32LE(input + 8);
      AES_DATA_IN_OUT_0_R = LOAD32LE(input + 12);

      //Wait for the output to be ready
      while((AES_CTRL_R & AES_CTRL_OUTPUT_READY) == 0)
      {
      }

      //Read output block
      temp = AES_DATA_IN_OUT_3_R;
      STORE32LE(temp, output);
      temp = AES_DATA_IN_OUT_2_R;
      STORE32LE(temp, output + 4);
      temp = AES_DATA_IN_OUT_1_R;
      STORE32LE(temp, output + 8);
      temp = AES_DATA_IN_OUT_0_R;
      STORE32LE(temp, output + 12);

      //Next block
      input += AES_BLOCK_SIZE;
      output += AES_BLOCK_SIZE;
      length -= AES_BLOCK_SIZE;
   }

   //Process final block of data
   if(length > 0)
   {
      uint32_t buffer[4];

      //Copy partial block
      osMemset(buffer, 0, AES_BLOCK_SIZE);
      osMemcpy(buffer, input, length);

      //Wait for the AES engine to be ready to accept data
      while((AES_CTRL_R & AES_CTRL_INPUT_READY) == 0)
      {
      }

      //Write input block
      AES_DATA_IN_OUT_3_R = buffer[0];
      AES_DATA_IN_OUT_2_R = buffer[1];
      AES_DATA_IN_OUT_1_R = buffer[2];
      AES_DATA_IN_OUT_0_R = buffer[3];

      //Wait for the output to be ready
      while((AES_CTRL_R & AES_CTRL_OUTPUT_READY) == 0)
      {
      }

