Oryx-Embedded/CycloneCRYPTO/hardware/f2838x/f2838x_crypto_cipher.c
         //Process plaintext
         while(length > 0)
         {
            //Limit the number of blocks to process at a time
            k = 256 - t[AES_BLOCK_SIZE - 1];
            n = MIN(length, k * AES_BLOCK_SIZE);
            k = (n + AES_BLOCK_SIZE - 1) / AES_BLOCK_SIZE;

            //Copy initial counter value
            osMemcpy(iv, t, AES_BLOCK_SIZE);

            //Encrypt payload data
            aesProcessData(context, iv, p, c, n, AES_DIRECTION_ENCRYPT |
               AES_OPMODE_CTR | AES_CTR_WIDTH_128BIT);

            //Standard incrementing function
            ctrIncBlock(t, k, AES_BLOCK_SIZE, m);

            //Next block
            p += n;
            c += n;
            length -= n;
         }
      }
      else
      {
         size_t i;
         size_t n;
         uint8_t o[16];

         //Process plaintext
         while(length > 0)
         {
            //CTR mode operates in a block-by-block fashion
            n = MIN(length, cipher->blockSize);

            //Compute O(j) = CIPH(T(j))
            cipher->encryptBlock(context, t, o);

            //Compute C(j) = P(j) XOR T(j)
            for(i = 0; i < n; i++)
            {
               c[i] = p[i] ^ o[i];
            }

            //Standard incrementing function
            ctrIncBlock(t, 1, cipher->blockSize, m);

            //Next block
            p += n;
            c += n;
            length -= n;
         }
      }
   }
   else
   {
      //The value of the parameter is not valid
      error = ERROR_INVALID_PARAMETER;
   }

   //Return status code
   return error;
}

#endif
#if (GCM_SUPPORT == ENABLED)

/**
 * @brief Perform AES-GCM encryption or decryption
 * @param[in] context AES algorithm context
 * @param[in] iv Initialization vector
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[out] t Authentication tag
 * @param[in] mode Operation mode
 **/

void gcmProcessData(AesContext *context, const uint8_t *iv,
   const uint8_t *a, size_t aLen, const uint8_t *input, uint8_t *output,
   size_t length, uint8_t *t, uint32_t mode)
{
   uint32_t temp;
   uint32_t buffer[4];

   //Acquire exclusive access to the AES module
   osAcquireMutex(&f2838xCryptoMutex);

   //Check parameters
   if(aLen > 0 || length > 0)
   {
      //Set GCM operation mode
      aesSetMode(AES_OPMODE_GCM_HY0CALC | mode);
      //Set encryption key
      aesLoadKey(context);

      //When the length of the IV is 96 bits, the padding string is appended to
      //the IV to form the pre-counter block
      AES_IV_IN_OUT_0_R = LOAD32LE(iv);
      AES_IV_IN_OUT_1_R = LOAD32LE(iv + 4);
      AES_IV_IN_OUT_2_R = LOAD32LE(iv + 8);
      AES_IV_IN_OUT_3_R = BETOH32(1);

      //Set data length
      AES_C_LENGTH_0_R = length;
      AES_C_LENGTH_1_R = 0;

      //Set additional authenticated data length
      AES_AUTH_LENGTH_R = aLen;

      //Process additional authenticated data
      while(aLen >= AES_BLOCK_SIZE)
      {
         //Wait for the AES engine to be ready to accept data
         while((AES_CTRL_R & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write block
         AES_DATA_IN_OUT_3_R = LOAD32LE(a);
         AES_DATA_IN_OUT_2_R = LOAD32LE(a + 4);
         AES_DATA_IN_OUT_1_R = LOAD32LE(a + 8);
         AES_DATA_IN_OUT_0_R = LOAD32LE(a + 12);

         //Next block
         a += AES_BLOCK_SIZE;
         aLen -= AES_BLOCK_SIZE;
      }

      //Process final block of additional authenticated data
      if(aLen > 0)
      {
         //Copy partial block
         osMemset(buffer, 0, AES_BLOCK_SIZE);
         osMemcpy(buffer, a, aLen);

         //Wait for the AES engine to be ready to accept data
         while((AES_CTRL_R & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write block
         AES_DATA_IN_OUT_3_R = buffer[0];
         AES_DATA_IN_OUT_2_R = buffer[1];
         AES_DATA_IN_OUT_1_R = buffer[2];
         AES_DATA_IN_OUT_0_R = buffer[3];
      }

      //Process data
      while(length >= AES_BLOCK_SIZE)
      {
         //Wait for the AES engine to be ready to accept data
         while((AES_CTRL_R & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write input block
         AES_DATA_IN_OUT_3_R = LOAD32LE(input);
         AES_DATA_IN_OUT_2_R = LOAD32LE(input + 4);
         AES_DATA_IN_OUT_1_R = LOAD32LE(input + 8);
         AES_DATA_IN_OUT_0_R = LOAD32LE(input + 12);

         //Wait for the output to be ready
         while((AES_CTRL_R & AES_CTRL_OUTPUT_READY) == 0)
         {
         }

         //Read output block
         temp = AES_DATA_IN_OUT_3_R;
         STORE32LE(temp, output);
         temp = AES_DATA_IN_OUT_2_R;
         STORE32LE(temp, output + 4);
         temp = AES_DATA_IN_OUT_1_R;
         STORE32LE(temp, output + 8);
         temp = AES_DATA_IN_OUT_0_R;
         STORE32LE(temp, output + 12);

         //Next block
         input += AES_BLOCK_SIZE;
         output += AES_BLOCK_SIZE;
         length -= AES_BLOCK_SIZE;
      }

      //Process final block of data
      if(length > 0)
      {
         //Copy partial block
         osMemset(buffer, 0, AES_BLOCK_SIZE);
         osMemcpy(buffer, input, length);

         //Wait for the AES engine to be ready to accept data
         while((AES_CTRL_R & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write input block
         AES_DATA_IN_OUT_3_R = buffer[0];
         AES_DATA_IN_OUT_2_R = buffer[1];
         AES_DATA_IN_OUT_1_R = buffer[2];
         AES_DATA_IN_OUT_0_R = buffer[3];

         //Wait for the output to be ready
         while((AES_CTRL_R & AES_CTRL_OUTPUT_READY) == 0)
         {
         }

         //Read output block
         buffer[0] = AES_DATA_IN_OUT_3_R;
         buffer[1] = AES_DATA_IN_OUT_2_R;
         buffer[2] = AES_DATA_IN_OUT_1_R;
         buffer[3] = AES_DATA_IN_OUT_0_R;

         //Copy partial block
         osMemcpy(output, buffer, length);
      }

      //Wait for the output context to be ready
      while((AES_CTRL_R & AES_CTRL_SVCTXTRDY) == 0)
      {
      }

      //Read the authentication tag
      temp = AES_TAG_OUT_0_R;
      STORE32LE(temp, t);
      temp = AES_TAG_OUT_1_R;
      STORE32LE(temp, t + 4);
      temp = AES_TAG_OUT_2_R;
      STORE32LE(temp, t + 8);
      temp = AES_TAG_OUT_3_R;
      STORE32LE(temp, t + 12);
   }
   else
   {
      //Set CTR operation mode
      aesSetMode(AES_DIRECTION_ENCRYPT | AES_OPMODE_CTR |
         AES_CTR_WIDTH_32BIT);

